DELETE
FROM MEAL;
DELETE
FROM USERS;
DELETE
FROM RESTAURANTS;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('Admin', 'user@yandex.ru', 'password'),
       ('Admin1', 'admin@gmail.com', 'admin'),
       ('Admin2', 'guest@gmail.com', 'guest');

INSERT INTO RESTAURANTS (USER_ID, NAME)
VALUES (100000, 'Ресторан Русской кухни'),
       (100000, 'Хинкальная №1'),
       (100001, 'KFC'),
       (100001, 'Вкусно и точка'),
       (100002, 'Панорама'),
       (100002, 'Пельменная');

INSERT INTO meal (RESTAURANT_ID, NAME, PRICE)
VALUES (100003, 'черный чай с сахаром', 10.5),
       (100003, 'суп гороховый', 70.0),
       (100003, 'гречневая каша', 30.3),
       (100003, 'салат мимоза', 30.3),
       (100004, 'чай с травами', 60.5),
       (100004, 'хинкали с бараниной', 300.8),
       (100004, 'соус сацебели', 50.5),
       (100004, 'соус хачапури', 100.0),
       (100005, 'капучино', 100.25),
       (100005, 'торт', 78.55),
       (100005, 'острые крылья', 170.5),
       (100005, 'картофель фри', 120.0),
       (100006, 'апельсиновый сок', 70.0),
       (100006, 'гамбургер с сыром', 130.0),
       (100006, 'картофель по деревенски', 120.0),
       (100006, 'сырный соус', 88.0),
       (100007, 'виски', 100.0),
       (100007, 'стек рибай', 1000.0),
       (100007, 'перечный соус', 250.0),
       (100007, 'овощи гриль', 450.0),
       (100008, 'компот из сухофруктов', 50.0),
       (100008, 'пельмени из говядины и свинины', 350.0),
       (100008, 'соус томатный', 20.0);

INSERT INTO MENU (RESTAURANT_ID, DATE)
VALUES (100003, '2023-03-05'),
       (100004, '2023-03-05'),
       (100005, '2023-03-05'),
       (100006, '2023-03-05');

INSERT INTO DISHES (MENU_ID, MEAL_ID)
VALUES (100032, 100009),
       (100032, 100010),
       (100032, 100011),
       (100032, 100012),
       (100033, 100013),
       (100033, 100014),
       (100033, 100015),
       (100033, 100016),
       (100034, 100017),
       (100034, 100018),
       (100034, 100019),
       (100034, 100020);


